#include <stdio.h>
#include <string.h>
int main()
{
   
    char a[]="nihao";
    // 定义一个整型数组b，并初始化为{1,2,3,4,5}
    int b[5]={1,2,3,4,5};
    // 定义一个浮点型数组c，并初始化为{1.1,2.2,3.3,4.4,5.5}
    float c[5]={1.1,2.2,3.3,4.4,5.5};
    // 定义一个双精度浮点型数组d，并初始化为{1.11,2.22,3.33,4.44,5.55}
    double d[5]={1.11,2.22,3.33,4.44,5.55};
    // // 打印字符数组a中每个元素的地址
    // printf("%p,%p,%p\n",&a[0],&a[1],&a[2]);
    // // 打印整型数组b中每个元素的地址
    // printf("%p,%p,%p\n",&b[0],&b[1],&b[2]);
    // // 打印浮点型数组c中每个元素的地址
    // printf("%p,%p,%p\n",&c[0],&c[1],&c[2]);
    //  // 打印浮点型数组d中每个元素的地址
    // printf("%p,%p,%p\n",&d[0],&d[1],&d[2]);
    int *p=b;
    printf("%d,%d,%d\n",*p,*(p+1),*(p+2)); //  定义一个整型指针p，指向数组b的首地址
    printf("%d,%d,%d\n",*b,*(b+1),*(b+2)); //  直接打印数组b中每个元素的值
    printf("%d,%d,%d\n",b[0],b[1],b[2]); //  直接打印数组b中每个元素的值
    float *p2=c;
    char *p1=a;
    printf("%c,%c,%c\n",*p2,*(p2+1),*(p2+2)); //  定义一个浮点型指针p2，指向数组c的首地址
    printf("%c,%c,%c\n",*p1,*(p1+1),*(p1+2)); //  定义一个字符型指针p1，指向数组a的首地址
    char *p3="i love you";
    for(int i=0;i<strlen(p3);i++)
    {
        printf("%c",p3[i]); //  定义一个浮点型指针p2，指向数组c的首地址
    }
    printf("\n");
   
    return 0;

} //  函数结束
