#include <stdio.h>
int main()
{int a[4][5]={{1,2,3,4,5},{6,7,8,9,10},{11,12,13,14,15},{16,17,18,19,20}};
// printf("%d\n",sizeof(a));
// printf("%p\n",a);
// printf("%p\n",a+1);i

int i,j,k=0;
for (i=0;i<4;i++)
{
    for(j=0;j<5;j++)
    {
        a[i][j]=k++; // 将数组a中的每个元素依次赋值为k，k从0开始递增
    }

}
printf("%p\n",*(a+1)); // 打印a+1指向的地址，即数组a的第二行的首地址
printf("%p\n",a[1]); // 打印数组a的第二行的首地址
printf("%p\n",&a[1][0]); // 打印数组a的第二行的首元素的地址
printf("%d\n",**(a+1)); // 打印数组a的第二行的首元素的值
printf("%d\n",*(*(a+1)+3)); // 打印数组a的第二行的第四个元素的值
printf("%d\n",a[1][3]); // 打印数组a的第二行的第四个元素的值
}
